api/actions/PosesAction.php

SELECT * FROM `poses` WHERE `branch_name` IN ('saburtalo', 'gldani', 'vake', 'digomi')
---
    public static function getPosesList() {
        $m = explode(",",\Yii::$app->user->identity->branch);

        return Poses::find()->where(["IN", "branch_name" , $m])->all();