api/actions/UserAction.php

    public static function getIngredients($product_category) {
        if ($product_category == 0)
            $result = Ingredients::find()->where(['base'=>0])->orderBy(['weight' => SORT_ASC])->All();
---
SELECT * FROM `ingredients` WHERE `base`=0 ORDER BY `weight`