common/models/User.php

    public static function findByUsername($username)
    {
        return static::findOne(['username' => $username, 'status' => self::STATUS_ACTIVE]);
---
SELECT * FROM `user` WHERE (`username`='webertela') AND (`status`=10)

    public static function findByPin($pin)
    {
        return static::findOne(['pin' => $pin, 'status' => self::STATUS_ACTIVE]);
---
SELECT * FROM `user` WHERE (`pin`='1111') AND (`status`=10)