api/models/database/OrderStatus.php

    public static function getStatusIdByKey($key) { return OrderStatus::find()->where(['status_key' => $key])->one()->id; }
---
SELECT * FROM `order_statuses` WHERE `status_key`='in_kitchen'