api/models/database/User.php

SELECT * FROM `user` WHERE `access_token`='ntoI_TodKtEjTTqj8HBVGmQPE3gW5TFY'
---
    public static function findIdentityByAccessToken($token, $type = null) {
        // return static::findOne(['access_token' => $token, 'status' => Status::getActive()]);
        return static::findOne(['access_token' => $token]);